Autodesk.Revit.UI.ModelessUIManager.RequestAccess(System.Guid)
Signals Revit that the UI component needs to make changes to the project
guid:
GUID of modelessUI component that requested access previously obtained via "registerUI" method
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given GUID is not of a registered ModelessUI component.
Since:
2017

Autodesk.Revit.UI.ModelessUIManager.UnregisterUI(System.Guid)
Unregisters a modeless UI component
guid:
GUID of the of modelessUI component to unregister
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given GUID is not of a registered ModelessUI component.
Since:
2017

Autodesk.Revit.UI.ModelessUIManager.RegisterUI(Autodesk.Revit.UI.IModelessUI)
Registers a modeless UI component
modelessUI:
Instance of modelessUI component
Returns:
This GUID is automatically generated for each of the modeless UI that registers to the manager.
Clients should store this ID in order to pass it to UnregisterUI and RequestAccess methods.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given ModelessUI component is not valid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
The given ModelessUI component is null.
-or-
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.UI.ModelessUIManager.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.UI.ModelessUIManager
This class manages modeless UI components (components which implement IModelessUI interface).
Add-ins must use this class to register a modelessUI component in order to be notified
when selection was changed or when it can modify the Revit document
Remarks:
This class is accessible from ModifyConnectionParametersServiceData.
It's exposed in internal API.
Since:
2017